<?php

namespace Database\Seeders;

use App\Models\JobPost;
use App\Models\Category;
use App\Models\Industry;
use App\Models\City;
use App\Models\Recruiter;
use App\Enums\JobTypeEnum;
use App\Enums\JobPostStateEnum;
use Illuminate\Database\Seeder;

class JobPostSeeder extends Seeder
{
    public function run(): void
    {
        $jobTitles = [
            'مطور برمجيات',
            'محاسب',
            'مدير مشروع',
            'مهندس نفط',
            'مدير تسويق',
            'مدير موارد بشرية',
            'مندوب مبيعات',
            'طبيب',
            'مدرس',
            'مصمم جرافيك',
        ];

        $descriptions = [
            'مطور برمجيات' => [
                'short_description' => 'تصميم وتطوير وصيانة تطبيقات البرمجيات.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تحليل متطلبات العملاء، وتصميم حلول برمجية مبتكرة، واختبار التطبيقات لضمان الجودة.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات</li>
                <li>شهادة جامعية في المجال</li>
                <li>إجادة اللغة الإنجليزية</li>
                <li>مهارات تواصل ممتازة</li>
                <li>القدرة على العمل ضمن فريق</li>
            </ul>
        '
            ],
            'محاسب' => [
                'short_description' => 'إدارة الشؤون المالية وإعداد التقارير.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن إعداد الميزانية العمومية، وتحليل البيانات المالية، والتأكد من الامتثال للوائح القانونية.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات</li>
                <li>شهادة جامعية في المجال</li>
                <li>إجادة اللغة الإنجليزية</li>
                <li>مهارات تواصل ممتازة</li>
                <li>القدرة على العمل ضمن فريق</li>
            </ul>
        '
            ],
            'مدير مشروع' => [
                'short_description' => 'إدارة المشاريع وضمان تسليمها في الوقت المحدد.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تخطيط وتنفيذ المشاريع، وتنسيق الفرق، وضمان تحقيق الأهداف ضمن الجدول الزمني.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في إدارة المشاريع</li>
                <li>شهادة جامعية في إدارة الأعمال أو مجال ذي صلة</li>
                <li>إجادة العمل على برامج إدارة المشاريع</li>
                <li>مهارات قيادية ممتازة</li>
                <li>القدرة على حل المشكلات بشكل فعال</li>
            </ul>
        '
            ],
            'مهندس نفط' => [
                'short_description' => 'استخراج وإنتاج النفط والغاز بفعالية.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تصميم وتنفيذ خطط استخراج النفط والغاز، وتحسين عمليات الإنتاج لضمان الكفاءة.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في مجال هندسة النفط</li>
                <li>شهادة جامعية في هندسة النفط أو الجيولوجيا</li>
                <li>معرفة متقدمة بأنظمة استخراج النفط</li>
                <li>القدرة على العمل في بيئات عمل صعبة</li>
                <li>مهارات تحليل قوية</li>
            </ul>
        '
            ],
            'مدير تسويق' => [
                'short_description' => 'تطوير وتنفيذ استراتيجيات التسويق.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تحليل السوق، ووضع استراتيجيات تسويقية، وتحسين العلامة التجارية وزيادة الإيرادات.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في مجال التسويق</li>
                <li>شهادة جامعية في التسويق أو إدارة الأعمال</li>
                <li>مهارات تواصل وتفاوض ممتازة</li>
                <li>معرفة بأدوات التسويق الرقمي</li>
                <li>القدرة على التفكير الإبداعي</li>
            </ul>
        '
            ],
            'مدير موارد بشرية' => [
                'short_description' => 'إدارة عمليات التوظيف وشؤون الموظفين.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تطوير السياسات والعمليات، وإدارة شؤون الموظفين، وضمان الامتثال للقوانين.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في الموارد البشرية</li>
                <li>شهادة جامعية في إدارة الأعمال أو الموارد البشرية</li>
                <li>معرفة بالقوانين المحلية المتعلقة بالعمل</li>
                <li>مهارات إدارية قوية</li>
                <li>القدرة على التعامل مع مختلف الشخصيات</li>
            </ul>
        '
            ],
            'مندوب مبيعات' => [
                'short_description' => 'بيع المنتجات والخدمات وزيادة قاعدة العملاء.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن التفاعل مع العملاء، وتقديم العروض، وإغلاق الصفقات لتحقيق أهداف المبيعات.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في مجال المبيعات</li>
                <li>مهارات تفاوض ممتازة</li>
                <li>القدرة على العمل تحت الضغط</li>
                <li>شهادة جامعية في مجال ذي صلة تعتبر ميزة إضافية</li>
                <li>مهارات بناء علاقات قوية</li>
            </ul>
        '
            ],
            'طبيب' => [
                'short_description' => 'تقديم الرعاية الطبية والتشخيص الدقيق.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تشخيص الأمراض ووصف العلاج المناسب، وضمان صحة وسلامة المرضى.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>شهادة طبية معتمدة</li>
                <li>رخصة مزاولة المهنة</li>
                <li>خبرة لا تقل عن 3 سنوات</li>
                <li>مهارات تواصل ممتازة</li>
                <li>القدرة على العمل تحت ضغط</li>
            </ul>
        '
            ],
            'مدرس' => [
                'short_description' => 'تدريس المناهج الدراسية وتوجيه الطلاب.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن إعداد الدروس، وتقييم الطلاب، وتعزيز التعلم التفاعلي.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>شهادة جامعية في التعليم أو التخصص المطلوب</li>
                <li>خبرة لا تقل عن 3 سنوات في التدريس</li>
                <li>مهارات تواصل وتوجيه ممتازة</li>
                <li>القدرة على التعامل مع الطلاب بمختلف مستوياتهم</li>
                <li>الإلمام باستخدام التكنولوجيا في التعليم</li>
            </ul>
        '
            ],
            'مصمم جرافيك' => [
                'short_description' => 'إنشاء تصاميم إبداعية للعلامات التجارية.',
                'description' => '
            <h2>وصف الوظيفة:</h2>
            <p>مسؤول عن تصميم الشعارات والمواد الإعلانية، وضمان تناسق الهوية البصرية.</p>
            <h2>المتطلبات:</h2>
            <ul>
                <li>خبرة لا تقل عن 3 سنوات في التصميم الجرافيكي</li>
                <li>إجادة استخدام برامج التصميم مثل Photoshop وIllustrator</li>
                <li>القدرة على التفكير الإبداعي</li>
                <li>مهارات إدارة الوقت</li>
                <li>الاهتمام بالتفاصيل</li>
            </ul>
        '
            ],
        ];


        $industries = Industry::all();
        $cities = City::all();
        $recruiters = Recruiter::all();
        $jobTypes = JobTypeEnum::cases();

        foreach ($jobTitles as $title) {
            JobPost::create([
                'title' => $title,
                'short_description' => $descriptions[$title]['short_description'] ?? '',
                'description' => $descriptions[$title]['description'] ?? '',
                'from_salary' => rand(2000, 5000),
                'to_salary' => rand(5000, 10000),
                'job_type' => $jobTypes[array_rand($jobTypes)]->value,
                'state' => JobPostStateEnum::Open,
                'recruiter_id' => $recruiters->random()->id,
                'industry_id' => $industries->random()->id,
                'city_id' => $cities->random()->id,
            ]);
        }
    }
}
